zjw939057120/OpenHarmony/device/board/my_company/gd32f470/liteos_m/di_task.c
/*
 * Copyright (c) 2026 zhangyao
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include <stdio.h>
#include <string.h>
#include "los_arch_interrupt.h"
#include "los_interrupt.h"
#include "los_sem.h"
#include "los_task.h"
#include "los_event.h"
#include "gd32f4xx.h"
#include "di_task.h"

static void *thread_di_task(unsigned int arg)
{
	while(1) {
		uint8_t di1 = di_read(DI1_INDEX);
		uint8_t di2 = di_read(DI2_INDEX);
		uint8_t di3 = di_read(DI3_INDEX);
		uint8_t di4 = di_read(DI4_INDEX);
		uint8_t di5 = di_read(DI5_INDEX);
		uint8_t di6 = di_read(DI6_INDEX);
		uint8_t di = di1 | (di2  << 1) | (di3 << 2) | (di4 << 3) | (di5 << 4) | (di6 << 5);
		SEGGER_RTT_printf(0, "di: %d\r\n", di);
		LOS_TaskDelay(5000);
	}

    return NULL;
}

UINT32 di_task_init(void)
{
	UINT32 taskID;
	TSK_INIT_PARAM_S stTask = {
		.pfnTaskEntry = thread_di_task,
		.uwStackSize = 0x1000,
		.pcName = "diTask",
		.usTaskPrio = 6,
	};
	if (LOS_TaskCreate(&taskID, &stTask) != LOS_OK) {
		return -1;
	}
	return taskID;
}
